Config/Catalogs/ПрофилиИзмененияПлановПоПериодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПрофилиИзмененияПлановПоПериодам</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодСмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрофильИзменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПрофилиИзмененияПлановПоПериодам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ПараметрыОткрытия = Новый СТруктура("СтруктураНастроек",СтруктураНастроек);
	Ответ = Неопределено;
	
	ОткрытьФорму("Справочник.ПрофилиИзмененияПлановПоПериодам.Форма.Автозаполнение",ПараметрыОткрытия,ЭтаФорма,,,, Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = Неопределено Тогда
		Возврат;	
	Конецесли;
	
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		СтруктураНастроек = Ответ.СтруктураНастроек;
		Объект.ПрофильИзменения.Очистить();
		Для Каждого ЭлементСтруткуры Из Ответ.Данные Цикл
			НоваяСтрока = Объект.ПрофильИзменения.Добавить();
			НоваяСтрока.НомерПериода = ЭлементСтруткуры.Ключ;
			НоваяСтрока.Коэффициент = ЭлементСтруткуры.Значение;
		КонецЦикла;	
		СортироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураНастроек = Новый Структура;
КонецПроцедуры

&НаСервере
Процедура СортироватьНаСервере()
	ТЗ= Объект.ПрофильИзменения.Выгрузить();
	ТЗ.Сортировать("НомерПериода");
	Объект.ПрофильИзменения.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	СортироватьНаСервере();
КонецПроцедуры
